In [1]:
print ("Hello")

Hello

In [2]:
import numpy as np 
import pandas as pd

In [6]:
my_list = [10, 29, 38, 47, 56]
my_labels = ['a', 'b', 'c', 'd', 'e']
pd.Series(data=my_list, index=my_labels)

a    10
b    29
c    38
d    47
e    56
dtype: int64

In [7]:
arr = np.array([10, 29, 38, 47, 56])
pd.Series(arr, my_labels)

a    10
b    29
c    38
d    47
e    56
dtype: int64

In [8]:
dict = {'a': 10, 'b': 29, 'c': 38, 'd': 47, 'e': 56}
pd.Series(dict)

a    10
b    29
c    38
d    47
e    56
dtype: int64

In [17]:
arr = np.array([10, 29, 38, 47, 56])
ser = pd.Series(arr, my_labels, copy=True)

In [18]:
arr[0] = 32
ser

a    10
b    29
c    38
d    47
e    56
dtype: int64

In [25]:
ser1 = pd.Series(data=[1, 2, 3, 4], index=['USA', 'Germany', 'Italy', 'Japan'])
ser1

USA        1
Germany    2
Italy      3
Japan      4
dtype: int64

In [39]:
ser2 = pd.Series(data = [10, 11, 12, 13], index=['USA', 'Germany', 'France', 'Japan'])
ser2['USA']

10

In [30]:
ser1 + ser2

France      NaN
Germany    13.0
Italy       NaN
Japan      17.0
USA        11.0
dtype: float64

In [31]:
np.add(ser1, ser2)

France      NaN
Germany    13.0
Italy       NaN
Japan      17.0
USA        11.0
dtype: float64

In [35]:
pd.concat([ser1, ser2])

USA         1
Germany     2
Italy       3
Japan       4
USA        10
Germany    11
France     12
Japan      13
dtype: int64

In [3]:
np.random.randn(3, 3)

array([[ 1.05478449, -1.60628068, -0.12499541],
       [ 0.5461382 , -0.22499373, -1.1564659 ],
       [-0.29619268, -1.09048444,  0.365283  ]])

In [4]:
df = pd.DataFrame(data=np.random.randn(3,3), index=['A', 'B', 'C'], columns=['X', 'Y', 'Z'], copy=True)
df

          X         Y         Z
A  1.657470  1.089063 -0.114620
B -0.336797 -1.329974 -1.783343
C  0.621495  0.806616  1.053855

In [47]:
df[['X' , 'Y']]

          X         Y
A -1.513899 -1.354759
B -0.168420  0.977181
C -0.722418  0.476046

In [48]:
df['W'] = [1, 2, 3]
df

          X         Y         Z  W
A -1.513899 -1.354759 -1.187638  1
B -0.168420  0.977181 -0.383113  2
C -0.722418  0.476046  0.333842  3

In [55]:
df.drop('A')

          X         Y         Z  W
B -0.168420  0.977181 -0.383113  2
C -0.722418  0.476046  0.333842  3

In [1]:
df = df.drop(['W'], axis=1)

NameError: name 'df' is not defined

In [58]:
df

          X         Y         Z
A -1.513899 -1.354759 -1.187638
B -0.168420  0.977181 -0.383113
C -0.722418  0.476046  0.333842

In [59]:
df.loc['A']

X   -1.513899
Y   -1.354759
Z   -1.187638
Name: A, dtype: float64

In [61]:
df.iloc[1]

X   -0.168420
Y    0.977181
Z   -0.383113
Name: B, dtype: float64

In [5]:
df

          X         Y         Z
A  1.657470  1.089063 -0.114620
B -0.336797 -1.329974 -1.783343
C  0.621495  0.806616  1.053855

In [11]:
df.loc['A']['X']

1.6574695500969134

In [12]:
df.iloc[0]

X    1.657470
Y    1.089063
Z   -0.114620
Name: A, dtype: float64

In [39]:
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [32, 22, 2, 44],
        'City':[' NY', ' LA', ' Chicago', ' Houston'],
        'Salary': [50000 , 50000 , 75000 , 65000 ]
        }
df = pd.DataFrame(data)
df

      Name  Age      City  Salary
0    Alice   32        NY   50000
1      Bob   22        LA   50000
2  Charlie    2   Chicago   75000
3    David   44   Houston   65000

In [17]:
gk = df.groupby('Salary').mean()
gk.get_group(50000)

TypeError: agg function failed [how->mean,dtype->object]

In [22]:
df.head(3)

      Name  Age      City  Salary
0    Alice   12        NY   50000
1      Bob   22        LA   60000
2  Charlie    2   Chicago   75000

In [23]:
df.tail()

      Name  Age      City  Salary
0    Alice   12        NY   50000
1      Bob   22        LA   60000
2  Charlie    2   Chicago   75000
3    David   13   Houston   90000

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   City    4 non-null      object
 3   Salary  4 non-null      int64
dtypes: int64(2), object(2)
memory usage: 256.0+ bytes

In [25]:
df.isna().sum()

Name      0
Age       0
City      0
Salary    0
dtype: int64

In [27]:
df.describe()

             Age   Salary
count   4.000000      4.0
mean   12.250000  68750.0
std     8.180261  17500.0
min     2.000000  50000.0
25%     9.500000  57500.0
50%    12.500000  67500.0
75%    15.250000  78750.0
max    22.000000  90000.0

In [28]:
df['Salary']

0    50000
1    60000
2    75000
3    90000
Name: Salary, dtype: int64

In [30]:
df['Salary'].min()

50000

In [31]:
df[['Salary', 'Age']].mean()

Salary    68750.00
Age          12.25
dtype: float64

In [32]:
df['Name'] == 'Bob'

0    False
1     True
2    False
3    False
Name: Name, dtype: bool

In [36]:
df_bool = df['Salary'] > 60000
type(df_bool)

pandas.core.series.Series

In [21]:
(df['Salary'] > 60000) & (df['Age'] > 40)

0    False
1    False
2    False
3     True
dtype: bool

In [45]:
sal_filter = df['Salary'] > 60000
age_filter = df['Age'] > 40

In [46]:
sal_filter

0    False
1    False
2     True
3     True
Name: Salary, dtype: bool

In [47]:
age_filter

0    False
1    False
2    False
3     True
Name: Age, dtype: bool

In [48]:
sal_filter[age_filter] == True

3    True
Name: Salary, dtype: bool

In [50]:
df[sal_filter & age_filter]['Name']

3    David
Name: Name, dtype: object

In [32]:
df

      Name  Age      City  Salary
0    Alice   12        NY   50000
1      Bob   22        LA   50000
2  Charlie    2   Chicago   75000
3    David   44   Houston   65000

In [43]:
gr = df[['Salary', 'Age']].groupby('Salary')
gr.value_counts()

Salary  Age
50000   22     1
        32     1
65000   44     1
75000   2      1
Name: count, dtype: int64

In [44]:
gr.mean()

         Age
Salary
50000   27.0
65000   44.0
75000    2.0

In [41]:
gr.describe()

         Age
       count  mean       std   min   25%   50%   75%   max
Salary
50000    2.0  27.0  7.071068  22.0  24.5  27.0  29.5  32.0
65000    1.0  44.0       NaN  44.0  44.0  44.0  44.0  44.0
75000    1.0   2.0       NaN   2.0   2.0   2.0   2.0   2.0

In [42]:
gr.min()

           Name  Age      City
Salary
50000     Alice   22        LA
65000     David   44   Houston
75000   Charlie    2   Chicago

In [68]:
df

      Name  Age      City  Salary
0    Alice   12        NY   50000
1      Bob   22        LA   50000
2  Charlie    2   Chicago   75000
3    David   44   Houston   75000

In [73]:
data = pd.read_csv('./Datasets/Ecommerce_Purchases.csv')

In [75]:
type(data)

pandas.core.frame.DataFrame

In [76]:
data.head()

,Address,Lot,AM or PM,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price
0,"16629 Pace Camp Apt. 448\nAlexisborough, NE 77...",46 in,PM,Opera/9.56.(X11; Linux x86_64; sl-SI) Presto/2...,Martinez-Herman,6011929061123406,02/20,900,JCB 16 digit,pdunlap@yahoo.com,"Scientist, product/process development",149.146.147.205,el,98.14
1,"9374 Jasmine Spurs Suite 508\nSouth John, TN 8...",28 rn,PM,Opera/8.93.(Windows 98; Win 9x 4.90; en-US) Pr...,"Fletcher, Richards and Whitaker",3337758169645356,11/18,561,Mastercard,anthony41@reed.com,Drilling engineer,15.160.41.51,fr,70.73
2,Unit 0065 Box 5052\nDPO AP 27450,94 vE,PM,Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...,"Simpson, Williams and Pham",675957666125,08/19,699,JCB 16 digit,amymiller@morales-harrison.com,Customer service manager,132.207.160.22,de,0.95
3,"7780 Julia Fords\nNew Stacy, WA 45798",36 vm,PM,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_0 ...,"Williams, Marshall and Buchanan",6011578504430710,02/24,384,Discover,brent16@olson-robinson.info,Drilling engineer,30.250.74.19,es,78.04
4,"23012 Munoz Drive Suite 337\nNew Cynthia, TX 5...",20 IE,AM,Opera/9.58.(X11; Linux x86_64; it-IT) Presto/2...,"Brown, Watson and Andrews",6011456623207998,10/25,678,Diners Club / Carte Blanche,christopherwright@gmail.com,Fine artist,24.140.33.94,es,77.82

In [77]:
data.iloc[0]

Address             16629 Pace Camp Apt. 448\nAlexisborough, NE 77...
Lot                                                             46 in
AM or PM                                                           PM
Browser Info        Opera/9.56.(X11; Linux x86_64; sl-SI) Presto/2...
Company                                               Martinez-Herman
Credit Card                                          6011929061123406
CC Exp Date                                                     02/20
CC Security Code                                                  900
CC Provider                                              JCB 16 digit
Email                                               pdunlap@yahoo.com
Job                            Scientist, product/process development
IP Address                                            149.146.147.205
Language                                                           el
Purchase Price                                                  98.14
Name: 0, dtype: object

In [79]:
df = pd.DataFrame(data)
df

,Address,Lot,AM or PM,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price
0,"16629 Pace Camp Apt. 448\nAlexisborough, NE 77...",46 in,PM,Opera/9.56.(X11; Linux x86_64; sl-SI) Presto/2...,Martinez-Herman,6011929061123406,02/20,900,JCB 16 digit,pdunlap@yahoo.com,"Scientist, product/process development",149.146.147.205,el,98.14
1,"9374 Jasmine Spurs Suite 508\nSouth John, TN 8...",28 rn,PM,Opera/8.93.(Windows 98; Win 9x 4.90; en-US) Pr...,"Fletcher, Richards and Whitaker",3337758169645356,11/18,561,Mastercard,anthony41@reed.com,Drilling engineer,15.160.41.51,fr,70.73
2,Unit 0065 Box 5052\nDPO AP 27450,94 vE,PM,Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...,"Simpson, Williams and Pham",675957666125,08/19,699,JCB 16 digit,amymiller@morales-harrison.com,Customer service manager,132.207.160.22,de,0.95
3,"7780 Julia Fords\nNew Stacy, WA 45798",36 vm,PM,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_0 ...,"Williams, Marshall and Buchanan",6011578504430710,02/24,384,Discover,brent16@olson-robinson.info,Drilling engineer,30.250.74.19,es,78.04
4,"23012 Munoz Drive Suite 337\nNew Cynthia, TX 5...",20 IE,AM,Opera/9.58.(X11; Linux x86_64; it-IT) Presto/2...,"Brown, Watson and Andrews",6011456623207998,10/25,678,Diners Club / Carte Blanche,christopherwright@gmail.com,Fine artist,24.140.33.94,es,77.82
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,"966 Castaneda Locks\nWest Juliafurt, CO 96415",92 XI,PM,Mozilla/5.0 (Windows NT 5.1) AppleWebKit/5352 ...,Randall-Sloan,342945015358701,03/22,838,JCB 15 digit,iscott@wade-garner.com,Printmaker,29.73.197.114,it,82.21
9996,"832 Curtis Dam Suite 785\nNorth Edwardburgh, T...",41 JY,AM,Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...,"Hale, Collins and Wilson",210033169205009,07/25,207,JCB 16 digit,mary85@hotmail.com,Energy engineer,121.133.168.51,pt,25.63
9997,Unit 4434 Box 6343\nDPO AE 28026-0283,74 Zh,AM,Mozilla/5.0 (Macintosh; U; Intel Mac OS X 10_7...,Anderson Ltd,6011539787356311,05/21,1,VISA 16 digit,tyler16@gmail.com,Veterinary surgeon,156.210.0.254,el,83.98
9998,"0096 English Rest\nRoystad, IA 12457",74 cL,PM,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_8;...,Cook Inc,180003348082930,11/17,987,American Express,elizabethmoore@reid.net,Local government officer,55.78.26.143,es,38.84
9999,"40674 Barrett Stravenue\nGrimesville, WI 79682",64 Hr,AM,Mozilla/5.0 (X11; Linux i686; rv:1.9.5.20) Gec...,Greene Inc,4139972901927273,02/19,302,JCB 15 digit,rachelford@vaughn.com,"Embryologist, clinical",176.119.198.199,el,67.59

In [80]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Address           10000 non-null  object
 1   Lot               10000 non-null  object
 2   AM or PM          10000 non-null  object
 3   Browser Info      10000 non-null  object
 4   Company           10000 non-null  object
 5   Credit Card       10000 non-null  int64
 6   CC Exp Date       10000 non-null  object
 7   CC Security Code  10000 non-null  int64
 8   CC Provider       10000 non-null  object
 9   Email             10000 non-null  object
 10  Job               10000 non-null  object
 11  IP Address        10000 non-null  object
 12  Language          10000 non-null  object
 13  Purchase Price    10000 non-null  float64
dtypes: float64(1), int64(2), object(11)
memory usage: 1.1+ MB

In [2]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']})

In [3]:
pd.merge(left, right, how='inner', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [5]:
pd.merge(left, right, how='outer', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [7]:
pd.merge(left, right, how='right', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [16]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                        'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                        'key2': ['K0', 'K0', 'K0', 'K0'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']})

In [17]:
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [18]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [19]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [24]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K0  NaN  NaN   C3   D3
5   K2   K1   A3   B3  NaN  NaN

In [25]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [21]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [26]:
left.join(right)

ValueError: columns overlap but no suffix specified: Index(['key1', 'key2'], dtype='object')